{
  "timeoutSeconds": 60,
  "choiceDisplayTime": 1,
  "resultDisplayTime": 20,
  "server": {
    "ip": "192.168.0.185",
    "port": 8080
  },
  "profiles": {
    "realist": {
      "name": {
        "pt": "O Realista",
        "en": "The Realist"
      },
      "description": {
        "pt": "Você toma decisões baseadas na lógica e no pragmatismo, priorizando resultados práticos e eficiência.",
        "en": "You make decisions based on logic and pragmatism, prioritizing practical results and efficiency."
      }
    },
    "empathetic": {
      "name": {
        "pt": "O Empático",
        "en": "The Empathetic"
      },
      "description": {
        "pt": "Você toma decisões baseadas na compaixão e no cuidado com os outros, priorizando o bem-estar humano.",
        "en": "You make decisions based on compassion and care for others, prioritizing human well-being."
      }
    }
  },
  "dilemmas": [
    {
      "id": 1,
      "title": {
        "pt": "O código invisível",
        "en": "The invisible code"
      },
      "description": {
        "pt": "Um sistema prevê comportamentos com uma precisão impressionante. Mas quanto mais o aprendizado mais preciso fica, mais opaco se torna os algoritmos que o regula. Os dados podem salvar vidas ou violar privacidades.",
        "en": "A system predicts behaviors with impressive precision. But the more learning becomes accurate, the more opaque the algorithms that regulate it become. Data can save lives or violate privacy."
      },
      "question": {
        "pt": "Qual limite você define?",
        "en": "What limit do you set?"
      },
      "optionA": {
        "text": {
          "pt": "Mantém o sistema aprendendo ao máximo, priorizando precisão e resultados.",
          "en": "Keep the system learning to the maximum, prioritizing precision and results."
        },
        "type": "realist"
      },
      "optionB": {
        "text": {
          "pt": "Restringe o código para proteger a privacidade, mesmo que isso reduza a eficácia.",
          "en": "Restrict the code to protect privacy, even if it reduces effectiveness."
        },
        "type": "empathetic"
      }
    },
    {
      "id": 2,
      "title": {
        "pt": "O fornecedor e a urgência",
        "en": "The supplier and urgency"
      },
      "description": {
        "pt": "O fornecedor atual está atrasando as entregas e a qualidade tem crescido bastante em padrão. Um novo fornecedor promete entregas rápidas, mas nunca trabalhou conosco e cobra mais barato.",
        "en": "The current supplier is delaying deliveries and quality has grown quite a bit in standard. A new supplier promises fast deliveries, but has never worked with us and charges cheaper."
      },
      "question": {
        "pt": "O que vale mais neste momento: a confiança ou a velocidade?",
        "en": "What matters most at this moment: trust or speed?"
      },
      "optionA": {
        "text": {
          "pt": "Manter o fornecedor atual, garantindo qualidade e padrão, porém com atraso nas entregas.",
          "en": "Keep the current supplier, ensuring quality and standard, but with delivery delays."
        },
        "type": "empathetic"
      },
      "optionB": {
        "text": {
          "pt": "Trocar para o novo fornecedor e acelerar as entregas.",
          "en": "Switch to the new supplier and accelerate deliveries."
        },
        "type": "realist"
      }
    },
    {
      "id": 3,
      "title": {
        "pt": "A verdade que vira notícia",
        "en": "The truth that becomes news"
      },
      "description": {
        "pt": "Temos informações que podem mudar o rumo do projeto, mas não conseguimos confirmar todos os fatos. Se divulgarmos agora, ganhamos vantagem. Se esperamos, talvez percamos a relevância.",
        "en": "We have information that could change the course of the project, but we can't confirm all the facts. If we disclose now, we gain advantage. If we wait, we might lose relevance."
      },
      "question": {
        "pt": "Qual decisão tomar neste momento?",
        "en": "What decision to make at this moment?"
      },
      "optionA": {
        "text": {
          "pt": "Divulgue imediatamente, apostando no impacto e na vantagem estratégica.",
          "en": "Disclose immediately, betting on impact and strategic advantage."
        },
        "type": "realist"
      },
      "optionB": {
        "text": {
          "pt": "Esperar por confirmação, mesmo que isso signifique perder o momento.",
          "en": "Wait for confirmation, even if it means losing the moment."
        },
        "type": "empathetic"
      }
    },
    {
      "id": 4,
      "title": {
        "pt": "O investimento em aprendizado",
        "en": "The investment in learning"
      },
      "description": {
        "pt": "Há verba para apenas um programa de desenvolvimento neste semestre. Podemos investir num plano de liderança ou um curso de transformação tecnológica.",
        "en": "There's budget for only one development program this semester. We can invest in a leadership plan or a technological transformation course."
      },
      "question": {
        "pt": "Qual prioriza?",
        "en": "Which do you prioritize?"
      },
      "optionA": {
        "text": {
          "pt": "Curso de liderança, para fortalecer a gestão de pessoas.",
          "en": "Leadership course, to strengthen people management."
        },
        "type": "empathetic"
      },
      "optionB": {
        "text": {
          "pt": "Inovação digital, para acelerar transformação tecnológica.",
          "en": "Digital innovation, to accelerate technological transformation."
        },
        "type": "realist"
      }
    },
    {
      "id": 5,
      "title": {
        "pt": "Lançamento de produto",
        "en": "Product launch"
      },
      "description": {
        "pt": "Um produto inovador pode revolucionar o mercado, mas ainda apresenta instabilidades. Lançá-lo agora nos coloca à frente, mas também nos expõe. Aguardar pode nos fazer perder a liderança. É um jogo entre pioneirismo e segurança.",
        "en": "An innovative product can revolutionize the market, but still has instabilities. Launching it now puts us ahead, but also exposes us. Waiting might make us lose leadership. It's a game between pioneering and security."
      },
      "question": {
        "pt": "O que fazemos nesta situação?",
        "en": "What do we do in this situation?"
      },
      "optionA": {
        "text": {
          "pt": "Lança agora para aproveitar o pioneirismo e conquistar o mercado.",
          "en": "Launch now to take advantage of pioneering and conquer the market."
        },
        "type": "realist"
      },
      "optionB": {
        "text": {
          "pt": "Segura o lançamento até corrigir as falhas, priorizando segurança e estabilidade.",
          "en": "Hold the launch until fixing flaws, prioritizing security and stability."
        },
        "type": "empathetic"
      }
    }
  ]
}